BAS BMEKZU Project/src/Catalogs/УдалитьИНАГРО_ФормыБизнесОпераций/УдалитьИНАГРО_ФормыБизнесОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьИНАГРО_ФормыБизнесОпераций</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Элеватор</name>
      <description>Элеватор</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипФормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВСоставеКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаВСоставеКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяОбработка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяФорма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеФормы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСохранения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЭлементыФормыБО</name>
    <attributes>
      <name>ИмяЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизитаСтр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизитаПВХ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.УдалитьИНАГРО_ДанныеБизнесОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПринадлежитТЧ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/УдалитьИНАГРО_ФормыБизнесОпераций/ObjectModule.bsl
#Если Клиент Тогда 
	// Функция возвращает форму рабочего стола при открытии задачи бизнес процесса.
	Функция ПолучитьФормуРабочегоСтола(ФормаВладелец=неопределено ,КлючУникальности=неопределено) Экспорт 
		//Если ФормаВладелец=неопределено тогда 
		//	ФормаВладелец = Обработки.ИНАГРО_ПанельБизнесОпераций.ПолучитьФорму("ОсновнаяФорма");
		//КонецЕсли;
		Если ЭтотОбъект.ТипФормы = 1 Тогда 
			ИмяОбработки = Лев(ОбработкаВСоставеКонфигурации,(Найти(ОбработкаВСоставеКонфигурации,"(")-1));
			ИмяФормы = Лев(ФормаВСоставеКонфигурации,(Найти(ФормаВСоставеКонфигурации,"(")-1));
			если КлючУникальности=Неопределено Тогда 
				ФормаРабочегоСтола = Обработки[ИмяОбработки].ПолучитьФорму(ИмяФормы,ФормаВладелец);
			иначе 
				ФормаРабочегоСтола = Обработки[ИмяОбработки].ПолучитьФорму(ИмяФормы,ФормаВладелец,КлючУникальности);
			КонецЕсли;
			Возврат ФормаРабочегоСтола;
			
		ИначеЕсли ЭтотОбъект.ТипФормы = 2 Тогда
			ОбъектВнешняяОбработка = ВнешниеОбработки.Создать(ВнешняяОбработка);
			ИмяФормы = Лев(ВнешняяФорма,(Найти(ВнешняяФорма,"(")-1));
			если КлючУникальности=Неопределено Тогда 
				ФормаРабочегоСтола = ОбъектВнешняяОбработка.ПолучитьФорму(ИмяФормы,ФормаВладелец);
			иначе 
				ФормаРабочегоСтола = ОбъектВнешняяОбработка.ПолучитьФорму(ИмяФормы,ФормаВладелец,КлючУникальности);
			КонецЕсли;
			
			Возврат ФормаРабочегоСтола;
		ИначеЕсли ЭтотОбъект.ТипФормы = 3 Тогда
			
		КонецЕсли;
	КонецФункции
#КонецЕсли
